<nav class="setup">
    <div class="close_setup">
        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M18 6L6 18M6 6L18 18" stroke="black" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
        </svg>
    </div>
</nav>

<div class="top-content">
    <div class="logo-final">
        <img src="" alt="store-logo">
    </div>
    <div class="store-name">name</div>
</div>

<div class="product-text">
    <h2>
        <div>
            <span class="img">
                <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M17.3122 30.9372C16.7667 22.8519 22.8118 15.8853 30.8615 15.3224C31.1969 15.299 31.4053 15.0587 31.3826 14.7219C31.3599 14.385 31.1211 14.176 30.7857 14.1995C22.736 14.7624 15.8121 8.70264 15.2666 0.617335C15.2439 0.280448 15.0052 0.0714921 14.6698 0.0949458C14.3344 0.1184 14.1259 0.358627 14.1486 0.695515C14.6941 8.78082 8.64903 15.7474 0.599339 16.3103C0.263935 16.3338 0.055484 16.574 0.0782119 16.9109C0.10094 17.2478 0.339694 17.4567 0.675098 17.4333C8.72479 16.8704 15.6487 22.9301 16.1941 31.0154C16.2169 31.3523 16.4556 31.5612 16.791 31.5378C17.1264 31.5143 17.3349 31.2741 17.3122 30.9372Z" fill="#8F6B45"/>
                </svg>
            </span>
            <span><?php esc_html_e("ברכות על", "swap") ?></span>
        </div>
        <div>
            <span><?php esc_html_e("החנות החדשה!", "swap") ?></span>
            <span class="img">
                <svg width="43" height="57" viewBox="0 0 43 57" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path opacity="0.6" d="M15.7817 22.6246C14.3894 17.4031 17.4535 12.0699 22.6495 10.6708C22.866 10.6125 22.9716 10.4286 22.9136 10.211C22.8556 9.99343 22.6726 9.88726 22.4561 9.94555C17.2602 11.3446 11.953 8.2655 10.5608 3.04401C10.5027 2.82645 10.3197 2.72027 10.1032 2.77857C9.88674 2.83686 9.78109 3.02077 9.8391 3.23833C11.2313 8.45981 8.16725 13.7931 2.9713 15.1922C2.7548 15.2504 2.64915 15.4344 2.70716 15.6519C2.76517 15.8695 2.94817 15.9757 3.16467 15.9174C8.36062 14.5183 13.6678 17.5974 15.06 22.8189C15.118 23.0365 15.3011 23.1426 15.5176 23.0843C15.7341 23.026 15.8397 22.8421 15.7817 22.6246Z" fill="#C7A77F"/>
                    <path d="M20.5671 51.6104C22.6195 43.9131 30.443 39.374 38.1026 41.4365C38.4217 41.5224 38.6915 41.3659 38.777 41.0452C38.8626 40.7244 38.7068 40.4533 38.3876 40.3674C30.7281 38.3049 26.2111 30.443 28.2635 22.7457C28.349 22.425 28.1933 22.1539 27.8741 22.068C27.555 21.982 27.2852 22.1386 27.1997 22.4593C25.1473 30.1565 17.3238 34.6956 9.66417 32.6332C9.34502 32.5472 9.07524 32.7037 8.98973 33.0245C8.90421 33.3452 9.05997 33.6163 9.37912 33.7022C17.0387 35.7647 21.5556 43.6267 19.5032 51.3239C19.4177 51.6446 19.5735 51.9157 19.8926 52.0017C20.2118 52.0876 20.4816 51.9311 20.5671 51.6104Z" fill="#C7A77F"/>
                </svg>
            </span>
        </div>
    </h2>
    <p><?php esc_html_e("כעת ניתן להוסיף ולהעלות פריטים חדשים", "swap") ?></p>
</div>

<div class="control-final">
    <a class="add-new-product" id="upload-product" href="<?php echo esc_url(home_url()); ?>">
        <div>
            <svg width="50" height="51" viewBox="0 0 50 51" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M24.9995 10.0586L24.9995 40.0586M39.9995 25.0586L9.99951 25.0586" stroke="#A2845E" stroke-width="4.16667" stroke-linecap="round"/>
            </svg>
        </div>
        <div>
            <?php esc_html_e("העלאת פריט חדש", "swap") ?>
        </div>

    </a>

    <div class="close-final-section">

        <input type="submit" form="vendor_form" class="submit-vendor-btn" name="submit_vendor_form" value="סיום">

    </div>
</div>