<div class="bids-conditions-wrap">
    <div class="bids-conditions">
        <div class="bids-conditions-modal step1">
           <div class="bids-conditions-modal-content">
                <div>
                    <div class="close-upload-modal close-upload-modal-js">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M18 6L6 18M6 6L18 18" stroke="black" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        </svg>
                    </div>
                    <h4><?php esc_html_e("תנאי המכירה הפומבית") ?></h4>
                </div>
                <ul>
                    <li>
                        <div>
                            <svg width="30" height="25" viewBox="0 0 30 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M27.8398 17.0269L27.8396 17.0269L16.4786 12.7778V10.4402C17.6341 10.2 18.6717 9.58406 19.4199 8.69313C20.1767 7.79186 20.5911 6.66425 20.5929 5.50028V5.50021C20.5929 2.71416 18.2621 0.45 15.4 0.45C12.5379 0.45 10.2071 2.71416 10.2071 5.50021C10.2071 5.77916 10.3211 6.04639 10.5235 6.24319C10.7259 6.43995 11.0001 6.55025 11.2857 6.55025C11.5713 6.55025 11.8455 6.43995 12.0479 6.24319C12.2503 6.04639 12.3643 5.77916 12.3643 5.50021C12.3643 3.87507 13.725 2.55008 15.4 2.55008C17.075 2.55008 18.4357 3.87507 18.4357 5.50021C18.4357 7.12535 17.075 8.45033 15.4 8.45033C15.1144 8.45033 14.8402 8.56063 14.6378 8.75739C14.4354 8.95419 14.3214 9.22142 14.3214 9.50037V12.7788L2.96043 17.0269L2.96024 17.0269C2.37041 17.2502 1.86311 17.641 1.5045 18.1487C1.14587 18.6564 0.952595 19.2574 0.95 19.8736V19.8738V21.4999C0.95 23.1829 2.35818 24.55 4.08571 24.55H26.7143C28.4418 24.55 29.85 23.1829 29.85 21.4999L29.85 19.8738L29.85 19.8736C29.8474 19.2574 29.6541 18.6564 29.2955 18.1487C28.9369 17.641 28.4296 17.2502 27.8398 17.0269ZM27.6929 21.4999C27.6929 22.022 27.2557 22.4499 26.7143 22.4499H4.08571C3.54425 22.4499 3.10714 22.022 3.10714 21.4999V19.8738C3.10714 19.4844 3.35886 19.1275 3.73503 18.9866L15.4 14.624L27.065 18.9866C27.4411 19.1275 27.6929 19.4844 27.6929 19.8738V21.4999Z" fill="#8F6B45" stroke="#8F6B45" stroke-width="0.1"/>
                            </svg>
                        </div>
                        <div>
                            <h5><?php esc_html_e("ניהול המכירה הפומבית"); ?></h5>
                            <p><?php esc_html_e("הגדרת התנאים וניהול מלא בעמוד החנות") ?></p>
                        </div>
                    </li>

                    <li>
                        <div>
                            <svg width="33" height="27" viewBox="0 0 33 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M2 11.6053H31.0526M3.26316 11.6053L7.30526 24.2368C7.55789 24.9947 8.31579 25.5 9.07368 25.5H23.9789C24.7368 25.5 25.4947 24.9947 25.7474 24.2368L29.7895 11.6053M14.6316 1.5L7.68421 11.6053M18.421 1.5L25.3684 11.6053" stroke="#8F6B45" stroke-width="2.3" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>
                        </div>
                        <div>
                            <h5><?php esc_html_e("ניהול המכירה הפומבית"); ?></h5>
                            <p><?php esc_html_e("הגדרת התנאים וניהול מלא בעמוד החנות") ?></p>
                        </div>
                    </li>

                    <li>
                        <div>
                            <svg width="20" height="27" viewBox="0 0 20 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M17.7951 1.5H3.00493C2.44992 1.5 2 1.94992 2 2.50493C2 5.70322 3.27051 8.77051 5.53204 11.032L6.99507 12.4951C7.14036 12.6404 7.213 12.713 7.26501 12.7828C7.58226 13.2083 7.58226 13.7917 7.26501 14.2172C7.213 14.287 7.14036 14.3596 6.99507 14.5049L5.53205 15.968C3.27052 18.2295 2 21.2968 2 24.4951C2 25.0501 2.44992 25.5 3.00493 25.5H17.7951C18.3501 25.5 18.8 25.0501 18.8 24.4951C18.8 21.2968 17.5295 18.2295 15.268 15.968L13.8049 14.5049C13.6596 14.3596 13.587 14.287 13.535 14.2172C13.2177 13.7917 13.2177 13.2083 13.535 12.7828C13.587 12.713 13.6596 12.6404 13.8049 12.4951L15.268 11.032C17.5295 8.77051 18.8 5.70322 18.8 2.50493C18.8 1.94992 18.3501 1.5 17.7951 1.5Z" stroke="#8F6B45" stroke-width="2.3" stroke-linecap="round" stroke-linejoin="round"/>
                            </svg>
                        </div>
                        <div>
                            <h5><?php esc_html_e("מגבלת עריכה ושינויים"); ?></h5>
                            <p><?php esc_html_e("עד 10 שינויים ב-24 השעות הראשונות.") ?></p>
                        </div>
                    </li>
                </ul>
           </div>
            <div class="bids-conditions-modal-footer">
                <button class="next-bids"><?php esc_html_e("לשלב הבא"); ?></button>
                <button class="black close-upload-modal-js"><?php esc_html_e("ביטול"); ?></button>
            </div>
        </div>
        <div class="bids-conditions-modal step2">
            <div class="bids-conditions-modal-content">
                <div>
                    <div class="close-upload-modal close-upload-modal-js">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M18 6L6 18M6 6L18 18" stroke="black" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>
                        </svg>
                    </div>
                    <h4><?php esc_html_e("תנאי המכירה הפומבית") ?></h4>
                </div>
                <div class="bids-conditions-modal-content-rules">
                    <?php esc_html_e("סלורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש. תרבנך וסתעד לכנו סתשם השמה - לתכי מורגם בורק? לתיג ישבעס. סלורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית. סת אלמנקום ניסי נון ניבאה. דס איאקוליס וולופטה דיאם. וסטיבולום אט דולור, קראס אגת לקטוס וואל אאוגו וסטיבולום סוליסי טידום בעליק. סחטיר בלובק. תצטנפל בלינדו למרקל אס לכימפו, דול, צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן מנת. נולום ארווס סאפיאן - פוסיליס קוויס, אקווזמן ליבם סולגק. בראיט ולחת צורק מונחף, בגורמי מגמש."); ?>
                </div>
            </div>

            <div class="bids-conditions-modal-footer">
                <button class="next-bids transparent"><?php esc_html_e("לשלב הבא"); ?></button>
                <button class="black close-upload-modal-js"><?php esc_html_e("ביטול"); ?></button>
            </div>
        </div>
    </div>
</div>

<input type="checkbox" id="bids-conditions-rule" name="bids-conditions-rule" style="display: none;">