<?php
if (! defined('ABSPATH')) {
    exit; // Exit if accessed directly
}

$logo = $args["logo"] ?? "";
$name = $args["name"] ?? "";
$date = $args["date"] ?? "";
$comment = $args["comment"] ?? "";
$star = $args["star"] ?? "";
$size = $args["size"] ?? "";
$prod_img_set = $args["prod_img_set"] ?? [];
?>

<div class="comment-top">
    <div class="comment-logo">
        <img src="<?php echo esc_url($logo) ?>" alt="icon">
    </div>
    <div class="comment-name">
        <?php echo esc_html($name); ?>
    </div>
    <div class="comment-date">
        <?php echo esc_html($date); ?>
    </div>
</div>

<div class="comment-text-wrap">
    <?php if ($size): ?>
        <div class="comment-size">
            <span><?php esc_html_e("מידה שנשכרה:", "swap") ?></span>
            <span><?php echo esc_html($size); ?></span>
        </div>
    <?php endif; ?>

    <div class="comment-text">
        <?php echo esc_html($comment); ?>
    </div>
</div>

<div class="start-row">
    <?php if ($star) {
        for ($i = 0; $i < (int)$star; $i++) { ?>
            <span>
                <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M8 0.5L9.79611 6.02786H15.6085L10.9062 9.44427L12.7023 14.9721L8 11.5557L3.29772 14.9721L5.09383 9.44427L0.391548 6.02786H6.20389L8 0.5Z"
                        fill="#111111" />
                </svg>
            </span>
        <?php }

        for ($i = $star; $i < 5; $i++) { ?>
            <span>
                <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M7.52181 2.30205C7.67547 1.99076 7.75229 1.83511 7.85659 1.78538C7.94734 1.74211 8.05277 1.74211 8.14351 1.78538C8.24781 1.83511 8.32464 1.99076 8.4783 2.30205L9.93608 5.25536C9.98144 5.34726 10.0041 5.39321 10.0373 5.42889C10.0666 5.46048 10.1018 5.48607 10.1409 5.50425C10.1851 5.52479 10.2358 5.5322 10.3372 5.54702L13.598 6.02364C13.9414 6.07383 14.1131 6.09893 14.1926 6.1828C14.2617 6.25577 14.2942 6.35604 14.281 6.45569C14.2659 6.57022 14.1416 6.69129 13.893 6.93343L11.5343 9.23078C11.4608 9.3024 11.424 9.33821 11.4003 9.38081C11.3793 9.41854 11.3658 9.45998 11.3607 9.50284C11.3548 9.55125 11.3635 9.60183 11.3808 9.703L11.9373 12.9479C11.996 13.2902 12.0254 13.4613 11.9702 13.5628C11.9222 13.6512 11.8369 13.7132 11.7381 13.7315C11.6245 13.7526 11.4708 13.6717 11.1634 13.5101L8.24829 11.9771C8.15746 11.9293 8.11205 11.9054 8.0642 11.896C8.02184 11.8877 7.97827 11.8877 7.9359 11.896C7.88806 11.9054 7.84264 11.9293 7.75181 11.9771L4.83666 13.5101C4.52932 13.6717 4.37565 13.7526 4.26202 13.7315C4.16316 13.7132 4.07786 13.6512 4.02987 13.5628C3.97471 13.4613 4.00406 13.2902 4.06276 12.9479L4.6193 9.703C4.63665 9.60183 4.64532 9.55125 4.63945 9.50284C4.63426 9.45998 4.62078 9.41854 4.59978 9.38081C4.57606 9.33821 4.53929 9.3024 4.46576 9.23078L2.10708 6.93342C1.85848 6.69129 1.73418 6.57022 1.71906 6.45569C1.7059 6.35604 1.73841 6.25577 1.80754 6.1828C1.887 6.09893 2.05869 6.07383 2.40207 6.02364L5.66291 5.54702C5.76432 5.5322 5.81503 5.52479 5.85919 5.50425C5.89828 5.48607 5.93348 5.46048 5.96283 5.42889C5.99598 5.39321 6.01866 5.34726 6.06402 5.25536L7.52181 2.30205Z"
                        fill="#D9D9D9" />
                </svg>

            </span>
    <?php }
    } ?>
</div>

<div class="img-row">
    <?php
    if (!empty($prod_img_set)) {
        foreach ($prod_img_set as $key => $img) {
            if ($key === 4) {
                break;
            }
            $img = wp_get_attachment_image_src($img, 'full');

            if(!$img){
                continue;
            }
    ?>
            <div>
                <img src="<?php echo esc_url(reset($img)) ?>" alt="product image">
            </div>
    <?php }
    }
    ?>
</div>